# Data Statistics

In [2]:
import pandas as pd
import os
import numpy as np
import numpy

## Data dictionary

In [28]:
df_dic = pd.read_csv(os.path.join('Data','Other','Dictionary.csv'))
df_dic['TA_ID'] = df_dic['TA_ID'].astype(str)
df_dic.head()

,TA_ID,TAMBON_T,TAMBON_E,AM_ID,AMPHOE_T,AMPHOE_E,CH_ID,CHANGWAT_T,CHANGWAT_E,LAT,LONG,Population
0,100101,พระบรมมหาราชวัง,Phra Borom Maha Ratchawang,1001,พระนคร,Phra Nakhon,10,กรุงเทพมหานคร,Bangkok,13.751,100.492,4089
1,100102,วังบูรพาภิรมย์,Wang Burapha Phirom,1001,พระนคร,Phra Nakhon,10,กรุงเทพมหานคร,Bangkok,13.744,100.499,11586
2,100103,วัดราชบพิธ,Wat Ratchabophit,1001,พระนคร,Phra Nakhon,10,กรุงเทพมหานคร,Bangkok,13.750,100.499,3402
3,100104,สำราญราษฎร์,Samran Rat,1001,พระนคร,Phra Nakhon,10,กรุงเทพมหานคร,Bangkok,13.751,100.503,3431
4,100105,ศาลเจ้าพ่อเสือ,San Chaopho Suea,1001,พระนคร,Phra Nakhon,10,กรุงเทพมหานคร,Bangkok,13.754,100.497,3280

In [29]:
df_dic_bangkok_subdist = df_dic.loc[df_dic['TA_ID'].str[:2] == '10']
bangkok_subdist = df_dic_bangkok_subdist['TA_ID'].values
df_dic_nakhon_subdist = df_dic.loc[df_dic['TA_ID'].str[:2] == '80']
nakhon_subdist = df_dic_nakhon_subdist['TA_ID'].values
df_dic_krabi_subdist = df_dic.loc[df_dic['TA_ID'].str[:2] == '81']
krabi_subdist = df_dic_krabi_subdist['TA_ID'].values

## Monthly Breeding Site Detection Data

In [ ]:
df_detection = pd.read_csv(os.path.join('Data','Breeding-sites','csv','addrcode-index','detection.csv'))
df_detection.head()

In [ ]:
df_detection['date'] = pd.to_datetime(df_detection['date'],format = '%Y-%m-%d')
df_detection['Year'] = df_detection['date'].dt.year
df_detection['Month'] = df_detection['date'].dt.month
df_detection['addrcode'] = df_detection['addrcode'].astype(str)
df_detection['Year'] = df_detection['Year'].astype(str)
df_detection['Month'] = df_detection['Month'].astype(str)
df_detection = df_detection[['date','Year','Month','addrcode','bin','bowl','bucket','cup','jar','pottedplant','tire','vase','total']]
df_detection.head()

In [ ]:
df_detectionmonth = df_detection.groupby([df_detection['addrcode'].str[:2],df_detection['Year'],df_detection['Month']]).size().reset_index(name ='Count')
df_detectionmonth.head()

In [ ]:
df_detectionyear = df_detectionmonth.groupby([df_detectionmonth['addrcode'].str[:2],df_detectionmonth['Year']]).size().reset_index(name = 'NumMonth')
df_detectionyear

## Dengue Data

### Compare sub-district in Bangkok

In [ ]:
df_new_dic = pd.read_csv(os.path.join('Data','Other','Newver-Dictionary.csv'))
df_new_dic['PV_IDN'] = df_new_dic['PV_IDN'].astype(str)
df_new_dic = df_new_dic.loc[df_new_dic['PV_IDN'] == '10']
df_new_dic.head()

In [ ]:
df_dic_bangkok_subdist.head()

In [ ]:
df_dic_bangkok_compare = df_dic_bangkok_subdist.iloc[:,[0,1]]
df_dic_bangkok_compare.head()

In [ ]:
df_new_dic_bangkok = df_new_dic.iloc[:,[0,1]]
df_new_dic_bangkok.head()

In [ ]:
df_new_dic_bangkok.columns = ['TA_ID_NEW', 'TAMBON_T']
df_new_dic_bangkok.head()

In [ ]:
result = pd.merge(df_dic_bangkok_compare,df_new_dic_bangkok, on = 'TAMBON_T',how = 'outer')
result.head(10)
#result.to_csv('compare_subdist_bangkok.csv', encoding = 'utf-8')

## Combine Address Code into one column

In [ ]:
df_dengue_2014_2018 = pd.read_csv(os.path.join('Data','Dengue-cases','Dengue fever data','DF_5YEAR_WeekNum.csv'), low_memory = False)
df_dengue_2014_2018 = df_dengue_2014_2018.drop('Unnamed: 0', axis = 1)
df_dengue_2014_2018['ADDRCODE'] = df_dengue_2014_2018['ADDRCODE'].astype(str)
df_dengue_2014_2018['PROVINCE'] = df_dengue_2014_2018['PROVINCE'].astype(str)
df_dengue_2014_2018.head()

In [ ]:
size = len(df_dengue_2014_2018)
size

In [ ]:
addrcode = []
for i in range(size):
    if len(df_dengue_2014_2018['ADDRCODE'][i]) == 3:
        addrcode.append(df_dengue_2014_2018['PROVINCE'][i]+'0'+df_dengue_2014_2018['ADDRCODE'][i])
    elif len(df_dengue_2014_2018['ADDRCODE'][i]) == 4:
        addrcode.append(df_dengue_2014_2018['PROVINCE'][i]+df_dengue_2014_2018['ADDRCODE'][i])
    elif len(df_dengue_2014_2018['ADDRCODE'][i]) == 5:
        addrcode.append(df_dengue_2014_2018['PROVINCE'][i]+'0'+df_dengue_2014_2018['ADDRCODE'].str[:3][i])
    elif len(df_dengue_2014_2018['ADDRCODE'][i]) == 6:
        addrcode.append(df_dengue_2014_2018['PROVINCE'][i]+df_dengue_2014_2018['ADDRCODE'].str[:4][i])

In [ ]:
df_dengue_2014_2018['addrcode'] = addrcode
df_dengue_2014_2018 = df_dengue_2014_2018.drop('ADDRCODE', axis = 1)
df_dengue_2014_2018 = df_dengue_2014_2018.drop('PROVINCE', axis = 1)
df_dengue_2014_2018 = df_dengue_2014_2018[['addrcode','DATESICK','Year','Month','Day','Weeknum']]
df_dengue_2014_2018.columns = ['ADDRCODE','DATESICK','Year','Month','Day','WeekNum']

In [ ]:
df_dengue_2014_2018.head()
#df_dengue_2014_2018.to_csv('DF_5YEAR_FINAL.csv', encoding = 'utf-8')

In [ ]:
df_dengue_999999 = df_dengue_2014_2018.loc[df_dengue_2014_2018['ADDRCODE'].str[:4] == '1099']
df_dengue_999999

## Weekly Dengue cases Data

In [ ]:
list = ['100206','100212','100214','100308','100501','100905','100910',
        '101101','101201','101903','102001','102101','102301','102702',
        '102703','102704','102705','102901','103202','103402','104002',
        '105002','109999',
        '800206','800208','800805','801004','801005','801302','801309',
        '801503','802701',
        '810030','810040','810050','810101','810104','810301','810302',
        '810408','810502','810706','810766','810802','811150','813037',
        '814011','814012','814031','814034','814036','814038','814039',
        '814054','814056','814057','814076','801201','810102'] 

df_denguecase_weekly = pd.read_csv(os.path.join('Data','Dengue-cases','Dengue fever data','DF_5YEAR_AGG.csv'))
df_denguecase_weekly = df_denguecase_weekly.drop('Unnamed: 0', axis = 1)
#df_denguecase_weekly.columns = ['addrcode','Year','WeekNum','NumberCases']
df_denguecase_weekly['addrcode'] = df_denguecase_weekly['addrcode'].astype(str)
df_denguecase_weekly = df_denguecase_weekly.sort_values(['addrcode','Year','WeekNum'])
# for i in range(len(list)):
#     df_denguecase_weekly = df_denguecase_weekly[df_denguecase_weekly.addrcode != list[i]]
# df_denguecase_weekly = df_denguecase_weekly.reset_index()
# df_denguecase_weekly = df_denguecase_weekly.drop('index',axis = 1)
# df_denguecase_weekly.to_csv('DF_clean.csv',encoding = 'utf-8')
#df_denguecase_weekly.tail()

## Total number of Dengue cases in each province

In [ ]:
aggregation_function = {'NumberCases': 'sum'}
df_weekly_province = df_denguecase_weekly.groupby([df_denguecase_weekly['addrcode'].str[:2]]).aggregate(aggregation_function).reset_index()
df_weekly_province

In [ ]:
df_denguecase_weekly.tail()

## Fill zero case in no-incidence week

In [ ]:
sizedf = (len(df_denguecase_weekly))+1
df_denguecase_weekly.index  = df_denguecase_weekly.index+1
df_denguecase_weekly.loc[0] = [100101,2014,1,0]
df_denguecase_weekly.loc[sizedf] = [810808,2018,52,0]
df_denguecase_weekly =df_denguecase_weekly.sort_index()
df_denguecase_weekly.head()

In [ ]:
df_denguecase_weekly.tail()

In [ ]:
size = len(df_denguecase_weekly)
count = 1


for i in range(size-1):
    if df_denguecase_weekly['addrcode'][i+1] == df_denguecase_weekly['addrcode'][i]:
        if df_denguecase_weekly['WeekNum'][i+1]-df_denguecase_weekly['WeekNum'][i] < 0:
            if df_denguecase_weekly['Year'][i] == 2014:
                if df_denguecase_weekly['WeekNum'][i] != 52:
                    df_denguecase_weekly.loc[size+1+count] = [df_denguecase_weekly['addrcode'][i],df_denguecase_weekly['Year'][i], 52, 0]
                    count = count+1
            if df_denguecase_weekly['Year'][i] == 2015:
                ## if data in 2015 don't have week 53
                if df_denguecase_weekly['WeekNum'][i] != 53:
                    df_denguecase_weekly.loc[size+1+count] = [df_denguecase_weekly['addrcode'][i],df_denguecase_weekly['Year'][i], 53, 0]
                    count = count+1
            if df_denguecase_weekly['Year'][i] == 2016:
                if df_denguecase_weekly['WeekNum'][i] != 52:
                    df_denguecase_weekly.loc[size+1+count] = [df_denguecase_weekly['addrcode'][i],df_denguecase_weekly['Year'][i], 52, 0]
                    count = count+1
            if df_denguecase_weekly['Year'][i] == 2017:
                if df_denguecase_weekly['WeekNum'][i] != 52:
                    df_denguecase_weekly.loc[size+1+count] = [df_denguecase_weekly['addrcode'][i],df_denguecase_weekly['Year'][i], 52, 0]
                    count = count+1
            if df_denguecase_weekly['Year'][i] == 2018:
                if df_denguecase_weekly['WeekNum'][i] != 52:
                    df_denguecase_weekly.loc[size+1+count] = [df_denguecase_weekly['addrcode'][i],df_denguecase_weekly['Year'][i], 52, 0]
                    count = count+1
            ## if year is missing
            if(df_denguecase_weekly['Year'][i+1]-df_denguecase_weekly['Year'][i] > 1) :
                if(df_denguecase_weekly['Year'][i] == 2014):
                    for j in range(53):
                        df_denguecase_weekly.loc[size+1+count] = [df_denguecase_weekly['addrcode'][i],df_denguecase_weekly['Year'][i]+1, j+1, 0]
                        count = count+1
                else:
                    for k in range(52):
                        df_denguecase_weekly.loc[size+1+count] = [df_denguecase_weekly['addrcode'][i],df_denguecase_weekly['Year'][i]+1, k+1, 0]
                        count = count+1
                
            ## if next year don't have week 1
            if df_denguecase_weekly['WeekNum'][i+1] != 1:
                df_denguecase_weekly.loc[size+1+count] = [df_denguecase_weekly['addrcode'][i],df_denguecase_weekly['Year'][i+1], 1, 0]
                count = count+1
 
    elif df_denguecase_weekly['addrcode'][i+1] != df_denguecase_weekly['addrcode'][i]:
        if df_denguecase_weekly['Year'][i+1]-df_denguecase_weekly['Year'][i] < 0:
            if(df_denguecase_weekly['Year'][i+1] == 2014):
                if(df_denguecase_weekly['WeekNum'][i+1] != 1):
                    df_denguecase_weekly.loc[size+1+count] = [df_denguecase_weekly['addrcode'][i+1],2014, 1, 0]
df_denguecase_weekly = df_denguecase_weekly.sort_values(['addrcode','Year','WeekNum'])
df_denguecase_weekly = df_denguecase_weekly.reset_index()
df_denguecase_weekly = df_denguecase_weekly.drop('index', axis=1)       
df_denguecase_weekly.head()
df_denguecase_weekly.to_csv('DF_5YEAR.csv', encoding = 'utf-8')

In [ ]:
size = len(df_denguecase_weekly)
size

In [ ]:
## re-loop again for missing week from adding week 1 in previous step
count = 1
for i in range(size-1):
    if df_denguecase_weekly['WeekNum'][i+1]-df_denguecase_weekly['WeekNum'][i] > 1:
            numloop = df_denguecase_weekly['WeekNum'][i+1]-df_denguecase_weekly['WeekNum'][i]
            for j in range(1,numloop):
                df_denguecase_weekly.loc[size+1+count]  = [df_denguecase_weekly['addrcode'][i],df_denguecase_weekly['Year'][i], df_denguecase_weekly['WeekNum'][i]+j, 0]
                count = count+1
                
df_denguecase_weekly = df_denguecase_weekly.sort_values(['addrcode','Year','WeekNum'])
df_denguecase_weekly = df_denguecase_weekly.reset_index()
df_denguecase_weekly = df_denguecase_weekly.drop('index', axis=1)
df_denguecase_weekly.head()
#df_denguecase_weekly = df_denguecase_weekly.reset_index()
df_denguecase_weekly.to_csv('DF_5YEAR.csv', encoding = 'utf-8')

In [ ]:
size = len(df_denguecase_weekly)
size

## Matching Latitude-Longtitude to Sub-District
### Climatic Data

In [ ]:
#df_sub_bangkok = pd.read_csv(os.path.join('Data','Climatic Data Result','Bangkok_subdistrict.csv'))
#df_big_area_nakhon_krabi = pd.read_csv(os.path.join('Data','Climatic Data Result','big_area_Nakhon_Krabi_LST.csv'))
df_big_area_nakhon_krabi = pd.read_csv(os.path.join('Data','Climatic Data Result','big_area_Nakhon_Krabi_Rainfall.csv'))
#df_sub_bangkok['addrcode'] = df_sub_bangkok['addrcode'].astype(str)
df_big_area_nakhon_krabi['addrcode'] = df_big_area_nakhon_krabi['addrcode'].astype(str)
df_big_area_nakhon_krabi.head()

In [ ]:
df_point_bangkok = pd.read_csv(os.path.join('Data','Sub-district_point','BMA_LT.csv'))

In [ ]:
df_point_bangkok['X'] = df_point_bangkok['X'].astype(str)
df_point_bangkok['Y'] = df_point_bangkok['Y'].astype(str)
df_point_bangkok['X'] = df_point_bangkok['X'].str[:7]
df_point_bangkok['Y'] = df_point_bangkok['Y'].str[:7]
df_point_bangkok = df_point_bangkok.drop('BMA_CODE', axis = 1)
df_point_bangkok.columns = ['X','Y','addrcode']
df_point_bangkok['addrcode'] = df_point_bangkok['addrcode'].astype(str)
#df_point_bangkok.head()

In [ ]:
df_point_nakhon_krabi = pd.read_csv(os.path.join('Data','Climatic Data Result','XY_Coordinate_Nakhon_Krabi.csv'))

In [ ]:
df_point_nakhon_krabi.head()

In [ ]:
df_point_nakhon_krabi['X'] = df_point_nakhon_krabi['X'].astype(str)
df_point_nakhon_krabi['Y'] = df_point_nakhon_krabi['Y'].astype(str)
df_point_nakhon_krabi['X'] = df_point_nakhon_krabi['X'].str[:7]
df_point_nakhon_krabi['Y'] = df_point_nakhon_krabi['Y'].str[:7]
df_point_nakhon_krabi['addrcode'] = df_point_nakhon_krabi['addrcode'].astype(str)
df_point_nakhon_krabi.head()

### Bangkok LST

In [ ]:
from tqdm import tqdm
from os import listdir
path = '/Users/boonpakornnonthaleerak/Documents/GitHub/dengue_data_statistics/Data/Climatic Data Result/LST Result/'
filename = []
filelist= listdir(path)
for f in tqdm(filelist):
    if f.endswith('Bangkok.csv'):
        filename.append(f)

In [ ]:
len(filename)

In [ ]:
## === Small Area ===
for filename in filename:
    if filename.startswith('Small'):
        df_temp = pd.read_csv(os.path.join(path+filename))
        df_temp['X'] = df_temp['X'].astype(str)
        df_temp['Y'] = df_temp['Y'].astype(str)
        df_temp['X'] = df_temp['X'].str[:7]
        df_temp['Y'] = df_temp['Y'].str[:7]
        df_temp.head()

        df_result = pd.merge(df_temp,df_point_bangkok,how = 'inner', on = ['X','Y'])
        df_result = df_result.drop(['SUBDIST_BM','X','Y'],axis = 1)
        df_result['MOD11C2_20'] = df_result['MOD11C2_20']*0.02-273.15
        df_result['MOD11C2_20'] = df_result['MOD11C2_20'].round(2)
        df_result = df_result[['SCODE_BMA','MOD11C2_20']]
        df_result.columns = ['addrcode','temperature']
        df_result['temperature'].loc[df_result['temperature'] <0 ] = 0
        df_result.to_csv(path+'Code_'+filename, encoding = 'utf-8') 
    else:
        continue

In [ ]:
## === Big Area ===
for filename in filename:
    if filename.startswith('MOD'):
        df_temp = pd.read_csv(os.path.join(path+filename))
        df_temp = df_temp.drop(['ZONE_CODE','COUNT','AREA','MIN','MAX','RANGE','STD','SUM','VARIETY','MAJORITY','MINORITY','MEDIAN'], axis = 1)
        df_temp['SUB_CODE']= df_temp['SUB_CODE']+100000
        df_temp['SUB_CODE'] = df_temp['SUB_CODE'].astype(str)
        df_temp['MEAN'].loc[df_temp['MEAN'] > 7500 ] = df_temp['MEAN']*0.02-273.15
        df_temp['MEAN'] = df_temp['MEAN'].round(2)
        df_temp['MEAN'].loc[df_temp['MEAN'] <0 ] = 0
        df_temp.columns = ['addrcode','temperature']
        df_temp.head()
        df_result = pd.merge(df_temp,df_bigarea_bangkok,how = 'outer', on ='addrcode')
        df_result = df_result.fillna(0)
        df_result = df_result[['addrcode','temperature']]
        df_result.to_csv(path+'Code_'+filename, encoding = 'utf-8')
    else:
        continue

### Nakhon-Krabi LST

In [ ]:
from tqdm import tqdm
from os import listdir
#path = '/Users/boonpakornnonthaleerak/Documents/GitHub/dengue_data_statistics/Data/Climatic Data Result/LST Result/'
path = '/Users/boonpakornnonthaleerak/Documents/GitHub/dengue_data_statistics/Data/Climatic Data Result/Rainfall Result/'
filename = []
filelist= listdir(path)
for f in tqdm(filelist):
    if f.endswith('Nakhon_Krabi.csv'):
        filename.append(f)

In [ ]:
len(filename)

In [ ]:
## === Small Area ===
for filename in filename:
    if filename.startswith('Small'):
        df_temp = pd.read_csv(os.path.join(path+filename))
        df_temp['X'] = df_temp['X'].astype(str)
        df_temp['Y'] = df_temp['Y'].astype(str)
        df_temp['X'] = df_temp['X'].str[:7]
        df_temp['Y'] = df_temp['Y'].str[:7]
        df_temp.head()

        df_result = pd.merge(df_temp,df_point_nakhon_krabi,how = 'inner', on = ['X','Y'])
        df_result = df_result.drop(['POINT_NAKH','X','Y','TB_EN','OLD_TB_IDN'],axis = 1)
        #df_result['MOD11C2_20'] = df_result['MOD11C2_20']*0.02-273.15
        #df_result['MOD11C2_20'] = df_result['MOD11C2_20'].round(2)
        #df_result['MOD11C2_20'].loc[df_result['MOD11C2_20'] < 0] = None
        #df_result.columns = ['temperature','addrcode']
        #df_result = df_result[['addrcode','temperature']]
        df_result.columns = ['rainfall','addrcode']
        df_result = df_result[['addrcode','rainfall']]
        df_result['rainfall'] = df_result['rainfall'].round(2)
        df_result['rainfall'].loc[df_result['rainfall'] < 0] = None
        df_result = df_result[['addrcode','rainfall']]
        
        df_result.to_csv(path+'Code_'+filename, encoding = 'utf-8') 
    else:
        continue

In [ ]:
## === Big Area ===
for filename in filename:
    #if filename.startswith('MOD'):
    if filename.startswith('P_Rain'):
        df_temp = pd.read_csv(os.path.join(path+filename))

        #df_temp = df_temp.drop(['ZONE_CODE','COUNT','AREA','MIN','MAX','RANGE','STD','SUM','VARIETY','MAJORITY','MINORITY','MEDIAN'], axis = 1)
        #df_temp['TB_IDN'] = df_temp['TB_IDN'].astype(str)
        #df_temp.head()
        #df_temp['MEAN'].loc[df_temp['MEAN'] > 7500 ] = df_temp['MEAN']*0.02-273.15
        #df_temp['MEAN'] = df_temp['MEAN'].round(2)
        #df_temp['MEAN'].loc[df_temp['MEAN'] <0 ] = None
        #df_temp.columns = ['addrcode','temperature']
        df_temp = df_temp.drop(['ZONE_CODE','COUNT','AREA','MIN','MAX','RANGE','STD','SUM'], axis = 1)
        df_temp['MEAN'] = df_temp['MEAN'].round(2)
        df_temp.columns = ['addrcode','rainfall']
        df_temp['addrcode'] = df_temp['addrcode'].astype(str)
        
        df_result = pd.merge(df_temp,df_big_area_nakhon_krabi,how = 'outer', on ='addrcode')
        df_result.to_csv(path+'Code_'+filename, encoding = 'utf-8')
            
    else:
        continue

## Combine all files

In [ ]:
des_path = '/Users/boonpakornnonthaleerak/Documents/GitHub/dengue_data_statistics/Data/Climatic Data Result/'
all = []
for filename in filename:
    if filename.startswith('Code_'):
        df_com = pd.read_csv(os.path.join(path+filename))
        if filename.startswith('Code_Small_'):
            #weekday = filename[:-17][17:] 
            #day = weekday[4:]
            #year = weekday[:4]
            #df_com['Day'] = day
            weekday = filename[:-17][17:] 
            if(len(weekday) == 6): 
                year = weekday[2:]
                week = weekday[:1]
            elif(len(weekday) == 7): 
                year = weekday[3:]
                week = weekday[:2]
            
            df_com['Week'] = week
            df_com['Year'] = year
            all.append(df_com)
        #elif filename.startswith('Code_MOD'):
        elif filename.startswith('Code_P'):
            
            year = weekday[4:]
            week = weekday[:2]
            #weekday = filename[:-17][11:]
            #year = weekday[:4]
            #day = weekday[4:]
            #df_com['Day'] = day
            weekday = filename[:-17][11:]
            if(len(weekday) == 6):    
                year = weekday[2:]
                week = weekday[:1]
            elif(len(weekday) == 7):
                year = weekday[3:]
                week = weekday[:2]
            
            df_com['Week'] = week
            df_com['Year'] = year
            all.append(df_com)

big_frame = pd.concat(all, ignore_index=True)
big_frame = big_frame.drop('Unnamed: 0', axis = 1)
big_frame.to_csv(des_path+ 'Rainfall_Nakhon_Krabi_avg.csv', encoding = 'utf-8')

## Delete missing sub-district '801201', '810102'

In [ ]:
invalid = ['801201','810102']

In [ ]:
df_rainfall = pd.read_csv(os.path.join('Data','Climatic Data','Rainfall_Nakhon_Krabi.csv'))
df_rainfall = df_rainfall.drop('Unnamed: 0',axis = 1)
df_rainfall['addrcode'] = df_rainfall['addrcode'].astype(str)
df_rainfall.head()

In [ ]:
len(df_rainfall)

In [ ]:
for i in range(len(invalid)):
    df_rainfall = df_rainfall[df_rainfall.addrcode != invalid[i]]

In [ ]:
len(df_rainfall)

In [ ]:
df_rainfall.to_csv('Rainfall_Nakhon_Krabi_clean.csv', encoding ='utf-8')

In [ ]:
df_LST = pd.read_csv(os.path.join('Data','Climatic Data Result','LST_Nakhon_Krabi.csv'))
df_LST = df_LST.drop('Unnamed: 0',axis = 1)
df_LST['addrcode'] = df_LST['addrcode'].astype(str)
df_LST.head()

In [ ]:
len(df_LST)

In [ ]:
for i in range(len(invalid)):
    df_LST = df_LST[df_LST.addrcode != invalid[i]]

In [ ]:
len(df_LST)

In [ ]:
df_LST.to_csv('LST_Nakhon_Krabi_clean.csv', encoding ='utf-8')

## Checking missing sub-district of Container detection

In [ ]:
df_detection = pd.read_csv(os.path.join('Data','Breeding-sites','csv','addrcode-index','detection.csv'))
df_detection.head()

In [ ]:
df_allsub = pd.read_csv(os.path.join('Data','Climatic Data Result','addrcode_subdistrict.csv'))
df_allsub.head()

In [ ]:
df_missing = pd.merge(df_detection,df_allsub, how = 'outer', on = 'addrcode')
df_missing.head()
#df_missing.to_csv('detection_check.csv', encoding = 'utf-8')

## Delete missing sub-district for Container detection

In [ ]:
invalid = ['801302','801503','810101','810301','810302','810502','810802','801201','810102']

In [ ]:
df_rainfall = pd.read_csv(os.path.join('Data','Climatic Data','Rainfall_Nakhon_Krabi.csv'))
df_rainfall = df_rainfall.drop('Unnamed: 0',axis = 1)
df_rainfall['addrcode'] = df_rainfall['addrcode'].astype(str)
df_rainfall.head()

In [ ]:
len(df_rainfall)

In [ ]:
for i in range(len(invalid)):
    df_rainfall = df_rainfall[df_rainfall.addrcode != invalid[i]]

In [ ]:
len(df_rainfall)

In [ ]:
df_rainfall.to_csv('Rainfall_Nakhon_Krabi_Autocorrelation.csv', encoding ='utf-8')

## Creating DF

In [3]:
df_allsub = pd.read_csv(os.path.join('Data','Climatic Data Result','addrcode_subdistrict.csv'))
df_allsub['addrcode'][0]

100101

In [4]:
df_dengue = pd.DataFrame(columns=['addrcode','Year','WeekNum','NumberCases'])
df_dengue

Empty DataFrame
Columns: [addrcode, Year, WeekNum, NumberCases]
Index: []

In [5]:
len(df_allsub)

390

In [6]:
size = len(df_dengue)

In [7]:
count = 0

In [8]:

for i in range(len(df_allsub)):
    for j in range(52):
        df_dengue.loc[count] = [df_allsub['addrcode'][i],2014,j+1,0]
        count = count+1
    for k in range(53):
        df_dengue.loc[count] = [df_allsub['addrcode'][i],2015,k+1,0]
        count = count+1
    for l in range(52):
        df_dengue.loc[count] = [df_allsub['addrcode'][i],2016,l+1,0]
        count = count+1
    for m in range(52):
        df_dengue.loc[count] = [df_allsub['addrcode'][i],2017,m+1,0]
        count = count+1
    for n in range(24):
        df_dengue.loc[count] = [df_allsub['addrcode'][i],2018,n+1,0]
        count = count+1

In [9]:
df_dengue
df_dengue.to_csv('DF_0.csv',encoding = 'utf-8')

In [18]:
df_dengue_agg = pd.read_csv(os.path.join('Data','Dengue-cases','Dengue fever Data','DF_5YEAR_AGG.csv'))
df_dengue_agg = df_dengue_agg.drop('Unnamed: 0',axis = 1)
df_dengue_agg.head()

   addrcode  Year  WeekNum  NumberCases
0    100101  2014       47            1
1    100101  2015        4            1
2    100101  2015       21            1
3    100101  2015       22            1
4    100101  2015       27            1

In [19]:
list = ['100206','100212','100214','100308','100501','100905','100910',
        '101101','101201','101903','102001','102101','102301','102702',
        '102703','102704','102705','102901','103202','103402','104002',
        '105002','109999',
        '800104','800206','800208','800805','801004','801005','801302',
        '801309','801503','802701',
        '810030','810040','810050','810101','810104','810301','810302',
        '810408','810502','810706','810766','810802','811150','813037',
        '814011','814012','814031','814034','814036','814038','814039',
        '814054','814056','814057','814076','801201','810102'] 

df_dengue = pd.read_csv(os.path.join('Data','Dengue-cases','Dengue fever data','DF_0.csv'))
df_dengue = df_dengue.drop('Unnamed: 0', axis = 1)
df_dengue['addrcode'] = df_dengue['addrcode'].astype(str)
df_dengue_agg['addrcode'] = df_dengue_agg['addrcode'].astype(str)
df_dengue = df_dengue.sort_values(['addrcode','Year','WeekNum'])
for i in range(len(list)):
     df_dengue = df_dengue[df_dengue.addrcode != list[i]]
for i in range(len(list)):
     df_dengue_agg = df_dengue_agg[df_dengue_agg.addrcode != list[i]]
df_dengue = df_dengue.reset_index()
df_dengue = df_dengue.drop('index',axis = 1)
#df_dengue.to_csv('DF_00.csv',encoding = 'utf-8')
#df_denguecase_weekly.tail()

In [20]:
len(df_dengue)

86909

In [21]:
df_df = df_dengue.append(df_dengue_agg)
df_df['addrcode'] = df_df['addrcode'].astype(str)

In [22]:
df_df = df_df.reset_index()
df_df = df_df.drop('index', axis = 1)
df_df.head()

  addrcode  Year  WeekNum  NumberCases
0   100101  2014        1            0
1   100101  2014        2            0
2   100101  2014        3            0
3   100101  2014        4            0
4   100101  2014        5            0

In [23]:
aggregation_function = {'NumberCases': 'sum'}
df_df = df_df.groupby([df_df['addrcode'],df_df['Year'],df_df['WeekNum']]).aggregate(aggregation_function).reset_index()
df_df.head()
len(df_df)

87008

In [24]:
df_df.to_csv('DF.csv',encoding = 'utf-8')

## Dengue Case per Area

In [36]:
df_dengue = pd.read_csv(os.path.join('Data','Dengue-cases','Dengue fever data','DF.csv'))
df_dengue['addrcode'] = df_dengue['addrcode'].astype(str)
df_dengue.head()

  addrcode  Year  WeekNum  NumberCases
0   100101  2014        1            0
1   100101  2014        2            0
2   100101  2014        3            0
3   100101  2014        4            0
4   100101  2014        5            0

In [97]:
df_subdist_area = pd.read_csv(os.path.join('Data','Area and GSV','csv','subdistricts-area.csv'))
df_subdist_area['addrcode'] = df_subdist_area['addrcode'].astype(str)
df_subdist_area.head()

  addrcode   area
0   100101  14.11
1   100102   6.62
2   100103   1.97
3   100104   2.15
4   100105   1.39

In [98]:
aggregation_function = {'area': 'sum'}
df_dist_area = df_subdist_area.groupby(df_subdist_area['addrcode'].str[:4]).aggregate(aggregation_function).reset_index()
df_dist_area.head()

  addrcode     area
0     1001    49.81
1     1002   105.24
2     1003  2233.36
3     1004    37.26
4     1005   380.54

In [47]:
df_df_area = pd.merge(df_dengue,df_subdist_area, on = 'addrcode', how = 'inner')
df_df_area['area'] = df_df_area['area']/10
df_df_area['DFpA'] = df_df_area['NumberCases']/df_df_area['area']
df_df_area.tail()

      addrcode  Year  WeekNum  NumberCases     area      DFpA
86904   810808  2018       20            1  107.845  0.009273
86905   810808  2018       21            0  107.845  0.000000
86906   810808  2018       22            0  107.845  0.000000
86907   810808  2018       23            0  107.845  0.000000
86908   810808  2018       24            0  107.845  0.000000

In [48]:
df_df_area.to_csv('DFpArea.csv', encoding='utf-8')

## Dengue case per 10000 population

In [78]:
df_dengue = pd.read_csv(os.path.join('Data','Dengue-cases','Dengue fever data','DF.csv'))
df_dengue['addrcode'] = df_dengue['addrcode'].astype(str)
df_dengue.head()

  addrcode  Year  WeekNum  NumberCases
0   100101  2014        1            0
1   100101  2014        2            0
2   100101  2014        3            0
3   100101  2014        4            0
4   100101  2014        5            0

In [79]:
df_pop = pd.read_csv(os.path.join('Data','Population','addrcode-index','population.csv'))
df_pop['addrcode'] = df_pop['addrcode'].astype(str)
df_pop['population'] = df_pop['population'] / 10000
df_pop.head()

  addrcode  population
0   800101      4.3678
1   800102      1.7380
2   800103      1.7835
3   800106      0.8177
4   800107      1.4884

In [80]:
df_df_pop = pd.merge(df_dengue,df_pop, on = 'addrcode', how = 'inner')
df_df_pop['DFp10000Pop'] = df_df_pop['NumberCases']/df_df_pop['population']
df_df_pop.tail()

      addrcode  Year  WeekNum  NumberCases  population  DFp10000Pop
89001   810808  2018       20            1      0.7416     1.348436
89002   810808  2018       21            0      0.7416     0.000000
89003   810808  2018       22            0      0.7416     0.000000
89004   810808  2018       23            0      0.7416     0.000000
89005   810808  2018       24            0      0.7416     0.000000

In [81]:
#aggregation_function = {'DFp10000Pop': 'sum'}
#df_df_pop = df_df_pop.groupby(df_df_pop['addrcode']).aggregate(aggregation_function).reset_index()
df_df_pop.head()

  addrcode  Year  WeekNum  NumberCases  population  DFp10000Pop
0   100101  2014        1            0      0.4089          0.0
1   100101  2014        2            0      0.4089          0.0
2   100101  2014        3            0      0.4089          0.0
3   100101  2014        4            0      0.4089          0.0
4   100101  2014        5            0      0.4089          0.0

In [82]:
df_df_pop.to_csv('DF_10000Population.csv', encoding='utf-8')

In [31]:
df_df_pop_bangkok = df_df_pop.loc[df_df_pop['addrcode'].str[:2] == '10']
df_df_pop_bangkok['DFp10000Pop'] = df_df_pop_bangkok['DFp10000Pop'].round(3)
df_df_pop_nst = df_df_pop.loc[df_df_pop['addrcode'].str[:2] == '80']
df_df_pop_nst['DFp10000Pop'] = df_df_pop_nst['DFp10000Pop'].round(3)
df_df_pop_krabi = df_df_pop.loc[df_df_pop['addrcode'].str[:2] == '81']
df_df_pop_krabi['DFp10000Pop'] = df_df_pop_krabi['DFp10000Pop'].round(3)

/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  after removing the cwd from sys.path.
/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

In [32]:
df_df_pop_bangkok.to_csv('DFp10000Population_Bangkok.csv', encoding='utf-8')
df_df_pop_nst.to_csv('DFp10000Population_NST.csv', encoding='utf-8')
df_df_pop_krabi.to_csv('DFp10000Population_Krabi.csv', encoding='utf-8')

### District level

In [36]:
aggregation_function = {'DFp10000Pop': 'sum'}
df_df_pop_bangkok_dist = df_df_pop_bangkok.groupby(df_df_pop_bangkok['addrcode'].str[:4]).aggregate(aggregation_function).reset_index()
df_df_pop_nst_dist = df_df_pop_nst.groupby(df_df_pop_nst['addrcode'].str[:4]).aggregate(aggregation_function).reset_index()
df_df_pop_krabi_dist = df_df_pop_krabi.groupby(df_df_pop_krabi['addrcode'].str[:4]).aggregate(aggregation_function).reset_index()

In [37]:
df_df_pop_bangkok_dist.to_csv('DFp10000Population_Bangkok_District.csv', encoding='utf-8')
df_df_pop_nst_dist.to_csv('DFp10000Population_NST_District.csv', encoding='utf-8')
df_df_pop_krabi_dist.to_csv('DFp10000Population_Krabi_District.csv', encoding='utf-8')

## Container Density [Sub-district]

In [78]:
df_detection = pd.read_csv(os.path.join('Data','Breeding-sites','csv','addrcode-index','detection.csv'))
df_detection['addrcode'] = df_detection['addrcode'].astype(str)
df_detection = df_detection.drop('date',axis = 1)

In [79]:
list = ['102702','102703']
for i in range(len(list)):
     df_detection = df_detection[df_detection.addrcode != list[i]]

In [80]:
df_detection_bangkok = df_detection.loc[df_detection['addrcode'].str[:2] == '10']
df_detection_bangkok = df_detection_bangkok.reset_index()
df_detection_bangkok = df_detection_bangkok.drop('index',axis = 1)
df_detection_bangkok.to_csv('container_bangkok_subdist.csv',encoding = 'utf-8')
df_detection_krabi = df_detection.loc[df_detection['addrcode'].str[:2] == '81']
df_detection_krabi = df_detection_krabi.reset_index()
df_detection_krabi = df_detection_krabi.drop('index',axis = 1)
df_detection_krabi.to_csv('container_krabi_subdist.csv',encoding = 'utf-8')
df_detection_nst = df_detection.loc[df_detection['addrcode'].str[:2] == '80']
df_detection_nst = df_detection_nst.reset_index()
df_detection_nst = df_detection_nst.drop('index',axis = 1)
df_detection_nst.to_csv('container_NST_subdist.csv',encoding = 'utf-8')

In [64]:
## for Bangkok, NST, Krabi
df_cd = pd.merge(df_detection_nst,df_subdist_area, on = 'addrcode', how = 'inner')
df_cd['area'] = df_cd['area']/10
df_cd.head()

,addrcode,bin,bowl,bucket,misc_short,jar,pottedplant,tire,misc_tall,total,area
0,800204,147,1,314,2,0,177,37,0,678,107.058
1,800807,38,2,184,1,1,147,32,1,406,34.144
2,800120,128,16,787,20,47,907,150,2,2057,85.609
3,800501,35,0,107,2,0,72,8,0,224,45.183
4,800810,15,0,34,0,0,103,16,1,169,27.556

In [65]:
df_cd['bin'] = df_cd['bin']/df_cd['area']
df_cd['bin'] = df_cd['bin'].round(3)
df_cd['bowl'] = df_cd['bowl']/df_cd['area']
df_cd['bowl'] = df_cd['bowl'].round(3)
df_cd['bucket'] = df_cd['bucket']/df_cd['area']
df_cd['bucket'] = df_cd['bucket'].round(3)
df_cd['misc_short'] = df_cd['misc_short']/df_cd['area']
df_cd['misc_short'] = df_cd['misc_short'].round(3)
df_cd['jar'] = df_cd['jar']/df_cd['area']
df_cd['jar'] = df_cd['jar'].round(3)
df_cd['pottedplant'] = df_cd['pottedplant']/df_cd['area']
df_cd['pottedplant'] = df_cd['pottedplant'].round(3)
df_cd['tire'] = df_cd['tire']/df_cd['area']
df_cd['tire'] = df_cd['tire'].round(3)
df_cd['misc_tall'] = df_cd['misc_tall']/df_cd['area']
df_cd['misc_tall'] = df_cd['misc_tall'].round(3)
df_cd['total'] = df_cd['total']/df_cd['area']
df_cd['total'] = df_cd['total'].round(3)
df_cd = df_cd.drop('area', axis =1)
df_cd.head()

,addrcode,bin,bowl,bucket,misc_short,jar,pottedplant,tire,misc_tall,total
0,800204,1.373,0.009,2.933,0.019,0.000,1.653,0.346,0.000,6.333
1,800807,1.113,0.059,5.389,0.029,0.029,4.305,0.937,0.029,11.891
2,800120,1.495,0.187,9.193,0.234,0.549,10.595,1.752,0.023,24.028
3,800501,0.775,0.000,2.368,0.044,0.000,1.594,0.177,0.000,4.958
4,800810,0.544,0.000,1.234,0.000,0.000,3.738,0.581,0.036,6.133

In [66]:
df_cd.to_csv('CD_NST_subdist.csv', encoding='utf-8')

## Container Density [District]

In [108]:
df_detection = pd.read_csv(os.path.join('Data','Breeding-sites','csv','addrcode-index','detection.csv'))
df_detection['addrcode'] = df_detection['addrcode'].astype(str)
df_detection = df_detection.drop('date',axis = 1)
list = ['102702','102703']
for i in range(len(list)):
     df_detection = df_detection[df_detection.addrcode != list[i]]

In [109]:
aggregation_function = {'bin': 'sum', 'bowl': 'sum','bucket': 'sum', 'misc_short': 'sum', 'jar': 'sum', 'pottedplant': 'sum', 'tire': 'sum', 'misc_tall': 'sum', 'total': 'sum'}
df_detection_dist = df_detection.groupby(df_detection['addrcode'].str[:4]).aggregate(aggregation_function).reset_index()
df_detection_dist.head()

,addrcode,bin,bowl,bucket,misc_short,jar,pottedplant,tire,misc_tall,total
0,1001,167,87,509,73,22,1543,101,25,2527
1,1002,104,24,292,20,10,630,77,1,1158
2,1003,796,47,2679,30,169,3029,675,7,7432
3,1004,126,68,474,45,16,1070,143,14,1956
4,1005,1541,130,4342,85,262,7664,827,28,14879

In [110]:
df_detection_bangkok = df_detection_dist.loc[df_detection_dist['addrcode'].str[:2] == '10']
df_detection_bangkok = df_detection_bangkok.reset_index()
df_detection_bangkok = df_detection_bangkok.drop('index',axis = 1)
df_detection_bangkok.to_csv('container_bangkok_dist.csv',encoding = 'utf-8')
df_detection_krabi = df_detection_dist.loc[df_detection_dist['addrcode'].str[:2] == '81']
df_detection_krabi = df_detection_krabi.reset_index()
df_detection_krabi = df_detection_krabi.drop('index',axis = 1)
df_detection_krabi.to_csv('container_krabi_dist.csv',encoding = 'utf-8')
df_detection_nst = df_detection_dist.loc[df_detection_dist['addrcode'].str[:2] == '80']
df_detection_nst = df_detection_nst.reset_index()
df_detection_nst = df_detection_nst.drop('index',axis = 1)
df_detection_nst.to_csv('container_NST_dist.csv',encoding = 'utf-8')

In [111]:
## for Bangkok, NST, Krabi
df_cd = pd.merge(df_detection_nst,df_dist_area, on = 'addrcode', how = 'inner')
df_cd['area'] = df_cd['area']/10
df_cd.head()

,addrcode,bin,bowl,bucket,misc_short,jar,pottedplant,tire,misc_tall,total,area
0,8001,2343,114,8346,161,355,7322,1254,20,19915,508.149
1,8002,292,12,827,7,11,828,120,2,2099,225.089
2,8003,204,5,692,4,31,467,75,1,1479,314.590
3,8004,507,15,1607,38,66,1186,230,1,3650,395.549
4,8005,116,13,929,14,32,591,110,7,1812,451.063

In [112]:
df_cd['bin'] = df_cd['bin']/df_cd['area']
df_cd['bin'] = df_cd['bin'].round(3)
df_cd['bowl'] = df_cd['bowl']/df_cd['area']
df_cd['bowl'] = df_cd['bowl'].round(3)
df_cd['bucket'] = df_cd['bucket']/df_cd['area']
df_cd['bucket'] = df_cd['bucket'].round(3)
df_cd['misc_short'] = df_cd['misc_short']/df_cd['area']
df_cd['misc_short'] = df_cd['misc_short'].round(3)
df_cd['jar'] = df_cd['jar']/df_cd['area']
df_cd['jar'] = df_cd['jar'].round(3)
df_cd['pottedplant'] = df_cd['pottedplant']/df_cd['area']
df_cd['pottedplant'] = df_cd['pottedplant'].round(3)
df_cd['tire'] = df_cd['tire']/df_cd['area']
df_cd['tire'] = df_cd['tire'].round(3)
df_cd['misc_tall'] = df_cd['misc_tall']/df_cd['area']
df_cd['misc_tall'] = df_cd['misc_tall'].round(3)
df_cd['total'] = df_cd['total']/df_cd['area']
df_cd['total'] = df_cd['total'].round(3)
df_cd = df_cd.drop('area', axis =1)
df_cd.head()

,addrcode,bin,bowl,bucket,misc_short,jar,pottedplant,tire,misc_tall,total
0,8001,4.611,0.224,16.424,0.317,0.699,14.409,2.468,0.039,39.191
1,8002,1.297,0.053,3.674,0.031,0.049,3.679,0.533,0.009,9.325
2,8003,0.648,0.016,2.200,0.013,0.099,1.484,0.238,0.003,4.701
3,8004,1.282,0.038,4.063,0.096,0.167,2.998,0.581,0.003,9.228
4,8005,0.257,0.029,2.060,0.031,0.071,1.310,0.244,0.016,4.017

In [113]:
df_cd.to_csv('CD_NST_dist.csv', encoding='utf-8')

## DF per 100 Population

In [22]:
df_df100pop = pd.read_csv('DFp100Population.csv')
df_df100pop = df_df100pop.drop('Unnamed: 0',axis = 1)

aggregation_function = {'DFp100Pop': 'sum'}
df_df100pop = df_df100pop.groupby(df_df100pop['addrcode']).aggregate(aggregation_function).reset_index()
df_df100pop.head()

   addrcode  DFp100Pop
0    100101   0.635852
1    100102   0.422924
2    100103   0.793651
3    100104   0.845235
4    100105   0.548780

## CD concat DF

In [26]:
df_cddf = pd.merge(df_cd,df_df100pop, on = 'addrcode', how = 'inner')
df_cddf['addrcode'] = df_cddf['addrcode'].astype(str)
df_cddf.head()

,addrcode,bin,bowl,bucket,cup,jar,pottedplant,tire,vase,total,DFp100Pop
0,100508,39.348,2.066,97.150,2.207,5.869,175.799,20.989,0.704,344.133,0.518369
1,104605,5.088,0.372,19.484,0.248,2.668,18.677,3.909,0.000,50.447,0.634378
2,104604,4.449,0.708,23.761,0.202,0.607,26.997,5.157,0.000,61.881,0.734921
3,103704,27.403,10.874,82.210,8.264,2.610,150.935,34.798,1.740,318.834,1.120994
4,100108,17.143,17.143,102.857,45.714,5.714,268.571,0.000,0.000,457.143,0.969744

In [39]:
df_cddf_bkk = df_cddf.loc[df_cddf['addrcode'].str[:2] == '10']
df_cddf_bkk.to_csv('CD+DF100Pop_Bangkok.csv', encoding = 'utf-8')

In [40]:
df_cddf_nst = df_cddf.loc[df_cddf['addrcode'].str[:2] == '80']
df_cddf_nst.to_csv('CD+DF100Pop_NST.csv', encoding = 'utf-8')

In [41]:
df_cddf_krabi = df_cddf.loc[df_cddf['addrcode'].str[:2] == '81']
df_cddf_krabi.to_csv('CD+DF100Pop_Krabi.csv', encoding = 'utf-8')

## Area and Image Coverage

In [75]:
list = ['100206','100212','100214','100308','100501','100905','100910',
        '101101','101201','101903','102001','102101','102301','102702',
        '102703','102704','102705','102901','103202','103402','104002',
        '105002','109999',
        '800104','800206','800208','800805','801004','801005','801302',
        '801309','801503','802701',
        '810030','810040','810050','810101','810104','810301','810302',
        '810408','810502','810706','810766','810802','811150','813037',
        '814011','814012','814031','814034','814036','814038','814039',
        '814054','814056','814057','814076','801201','810102']

In [76]:
df_area = pd.read_csv(os.path.join('Data','Area and GSV','csv','gsv-coverage.csv'))
df_area['addrcode'] = df_area['addrcode'].astype(str)
for i in range(len(list)):
     df_area = df_area[df_area.addrcode != list[i]]
aggregation_function = {'land_area': 'sum','image_area' : 'sum'}
df_area = df_area.groupby(df_area['addrcode']).aggregate(aggregation_function).reset_index()
len(df_area)

373

In [77]:
df_area['image_coverage'] = df_area['image_area']/df_area['land_area']*100
df_area['image_coverage'] = df_area['image_coverage'].astype(float)
df_area['image_coverage'].loc[df_area['image_coverage'] > 100] = 100
df_area['image_coverage'] = df_area['image_coverage'].round(2)

/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/pandas/core/indexing.py:194: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

In [79]:
df_area_bangkok = df_area.loc[df_area['addrcode'].str[:2] == '10'].reset_index()
df_area_bangkok = df_area_bangkok.drop('index', axis = 1)
df_area_bangkok.to_csv('image_coverage_bangkok.csv', encoding ='utf-8')
df_area_nst = df_area.loc[df_area['addrcode'].str[:2] == '80'].reset_index()
df_area_nst = df_area_nst.drop('index', axis = 1)
df_area_nst.to_csv('image_coverage_nst.csv', encoding ='utf-8')
df_area_krabi = df_area.loc[df_area['addrcode'].str[:2] == '81'].reset_index()
df_area_krabi = df_area_krabi.drop('index', axis = 1)
df_area_krabi.to_csv('image_coverage_krabi.csv', encoding ='utf-8')

## Matching population Data

In [31]:
df_dic_nakhon_subdist.head()

,TA_ID,TAMBON_T,TAMBON_E,AM_ID,AMPHOE_T,AMPHOE_E,CH_ID,CHANGWAT_T,CHANGWAT_E,LAT,LONG,Population
6296,800101,ในเมือง,Nai Mueang,8001,เมืองนครศรีธรรมราช,Mueang Nakhon Si Thammarat,80,นครศรีธรรมราช,Nakhon Si Thammarat,8.408,99.972,43678
6297,800102,ท่าวัง,Tha Wang,8001,เมืองนครศรีธรรมราช,Mueang Nakhon Si Thammarat,80,นครศรีธรรมราช,Nakhon Si Thammarat,8.449,99.961,17380
6298,800103,คลัง,Khlang,8001,เมืองนครศรีธรรมราช,Mueang Nakhon Si Thammarat,80,นครศรีธรรมราช,Nakhon Si Thammarat,8.434,99.966,17835
6299,800106,ท่าไร่,Tha Rai,8001,เมืองนครศรีธรรมราช,Mueang Nakhon Si Thammarat,80,นครศรีธรรมราช,Nakhon Si Thammarat,8.430,100.041,8177
6300,800107,ปากนคร,Pak Nakhon,8001,เมืองนครศรีธรรมราช,Mueang Nakhon Si Thammarat,80,นครศรีธรรมราช,Nakhon Si Thammarat,8.421,99.996,14884

In [46]:
df_pop_nakhon = pd.read_csv(os.path.join('Data','Population','full-info','Nakhon-population-details.csv'))
df_pop_nakhon['addrcode'] = df_pop_nakhon['addrcode'].astype(str)
df_pop_nakhon.head()

,district,addrcode,name,"< 1 yr, Male","< 1 yr, Female","1 yr, Male","1 yr, Female","2 yr, Male","2 yr, Female","3 yr, Male",...,"98 yr, Female","99 yr, Male","99 yr, Female","100 yr, Male","100 yr, Female","> 100 yr, Male","> 100 yr, Female",Male,Female,Total
0,8016,801611,เกาะเพชร,38,37,30,32,44,24,42,...,2,2,2,1,1,1,3,3485,3416,6901
1,8007,800708,เกาะขันธ์,36,38,51,34,48,37,56,...,1,0,2,0,0,0,0,4475,4486,8961
2,8012,801206,เกาะทวด,23,21,31,26,28,28,23,...,0,0,1,0,1,3,4,2585,2548,5133
3,8003,800301,เขาแก้ว,35,30,35,44,45,34,50,...,2,0,1,0,1,0,2,3702,3908,7610
4,8009,800907,เขาโร,56,66,75,58,84,66,93,...,0,0,0,0,0,0,1,5253,5346,10599

In [47]:
list = ['100206','100212','100214','100308','100501','100905','100910',
        '101101','101201','101903','102001','102101','102301','102702',
        '102703','102704','102705','102901','103202','103402','104002',
        '105002','109999',
        '800104','800206','800208','800805','801004','801005','801302',
        '801309','801503','802701',
        '810030','810040','810050','810101','810104','810301','810302',
        '810408','810502','810706','810766','810802','811150','813037',
        '814011','814012','814031','814034','814036','814038','814039',
        '814054','814056','814057','814076','801201','810102'] 

for i in range(len(list)):
     df_pop_nakhon = df_pop_nakhon[df_pop_nakhon.addrcode != list[i]]

In [48]:
len(df_pop_nakhon)
df_pop_nakhon = df_pop_nakhon.reset_index()
df_pop_nakhon = df_pop_nakhon.drop(['index','name'], axis  =1)
df_pop_nakhon.head()

,district,addrcode,"< 1 yr, Male","< 1 yr, Female","1 yr, Male","1 yr, Female","2 yr, Male","2 yr, Female","3 yr, Male","3 yr, Female",...,"98 yr, Female","99 yr, Male","99 yr, Female","100 yr, Male","100 yr, Female","> 100 yr, Male","> 100 yr, Female",Male,Female,Total
0,8016,801611,38,37,30,32,44,24,42,35,...,2,2,2,1,1,1,3,3485,3416,6901
1,8007,800708,36,38,51,34,48,37,56,46,...,1,0,2,0,0,0,0,4475,4486,8961
2,8012,801206,23,21,31,26,28,28,23,26,...,0,0,1,0,1,3,4,2585,2548,5133
3,8003,800301,35,30,35,44,45,34,50,46,...,2,0,1,0,1,0,2,3702,3908,7610
4,8009,800907,56,66,75,58,84,66,93,77,...,0,0,0,0,0,0,1,5253,5346,10599

In [49]:
df_pop_nakhon.to_csv('Nakhon-population-details.csv', encoding = 'utf-8')

## Merging Data

### 2014-2016 [Training]

In [34]:
df_rain = pd.read_csv(os.path.join('Data','Climatic Data','Rainfall_Nakhon_Krabi.csv'))
df_rain = df_rain.drop('Unnamed: 0', axis =1 )
df_rain['addrcode'] = df_rain['addrcode'].astype(str)
df_rain = df_rain.loc[df_rain['addrcode'].str[:2] == '80']
df_lst_2014 = pd.read_csv(os.path.join('Data','Climatic Data','LST_weekly_NST_2014.csv'))
df_lst_2014 = df_lst_2014.drop('Unnamed: 0', axis =1 )
df_lst_2014['addrcode'] = df_lst_2014['addrcode'].astype(str)
df_lst_2014['Year'] = df_lst_2014['Year'].astype(str)
df_lst_2015 = pd.read_csv(os.path.join('Data','Climatic Data','LST_weekly_NST_2015.csv'))
df_lst_2015 = df_lst_2015.drop('Unnamed: 0', axis =1 )
df_lst_2015['addrcode'] = df_lst_2015['addrcode'].astype(str)
df_lst_2015['Year'] = df_lst_2015['Year'].astype(str)
df_lst_2016 = pd.read_csv(os.path.join('Data','Climatic Data','LST_weekly_NST_2016.csv'))
df_lst_2016 = df_lst_2016.drop('Unnamed: 0', axis =1 )
df_lst_2016['addrcode'] = df_lst_2016['addrcode'].astype(str)
df_lst_2016['Year'] = df_lst_2016['Year'].astype(str)
df_df10000pop = pd.read_csv(os.path.join('Data','Dengue-cases','Dengue fever data','DFp10000Population_NST.csv'))

In [35]:
df_rain = df_rain.loc[df_rain['Year'] < 2017]
df_rain = df_rain.sort_values(['Week','Year','addrcode'])
df_rain = df_rain[['Week','Year','addrcode','rainfall']]
df_rain['Year'] = df_rain['Year'].astype(str)
len(df_rain)

24883

In [36]:
df_lst_2014 = df_lst_2014.loc[df_lst_2014['Week'] > 8]
df_lst_2014.head()

     Week  Year addrcode  temperature
167    10  2014   800101    33.384643
168    10  2014   800102    33.493571
169    10  2014   800103    33.493571
170    10  2014   800106    32.094643
171    10  2014   800107    31.973571

In [37]:
frame = [df_lst_2014, df_lst_2015, df_lst_2016]
df_lst = pd.concat(frame)
df_lst['addrcode'] = df_lst['addrcode'].astype(str)
len(df_lst)

24883

In [38]:
df_rain_lst = pd.merge(df_rain,df_lst, how = 'inner', on = ['Week','Year','addrcode'])
df_rain_lst.head()

   Week  Year addrcode  rainfall  temperature
0     1  2015   800101       0.0      26.8175
1     1  2015   800102       0.0      26.1575
2     1  2015   800103       0.0      26.1575
3     1  2015   800106       0.0      27.2800
4     1  2015   800107       0.0      26.6400

In [39]:
df_df = pd.read_csv(os.path.join('Data','Dengue-cases','Dengue fever data','DF_10000Population.csv'))
df_df = df_df.drop(['Unnamed: 0','NumberCases','population'], axis = 1)
df_df.columns = ['addrcode','Year','Week','DF10000Pop']
df_df['addrcode'] = df_df['addrcode'].astype(str)
df_df['Year'] = df_df['Year'].astype(str)
df_df.head()

  addrcode  Year  Week  DF10000Pop
0   100101  2014     1         0.0
1   100101  2014     2         0.0
2   100101  2014     3         0.0
3   100101  2014     4         0.0
4   100101  2014     5         0.0

In [40]:
df_rain_lst_df = pd.merge(df_rain_lst, df_df, how = 'inner', on = ['Year','Week','addrcode'])
df_rain_lst_df.head()

   Week  Year addrcode  rainfall  temperature  DF10000Pop
0     1  2015   800101       0.0      26.8175         0.0
1     1  2015   800102       0.0      26.1575         0.0
2     1  2015   800103       0.0      26.1575         0.0
3     1  2015   800106       0.0      27.2800         0.0
4     1  2015   800107       0.0      26.6400         0.0

In [41]:
df_cd = pd.read_csv(os.path.join('Data','Container Density','Subdistrict Level','CD_NST_subdist.csv'))
df_cd = df_cd.drop(['Unnamed: 0','total'],axis = 1)
df_cd['addrcode'] = df_cd['addrcode'].astype(str)
df_cd.head()

,addrcode,bin,bowl,bucket,misc_short,jar,pottedplant,tire,misc_tall
0,800204,1.373,0.009,2.933,0.019,0.000,1.653,0.346,0.000
1,800807,1.113,0.059,5.389,0.029,0.029,4.305,0.937,0.029
2,800120,1.495,0.187,9.193,0.234,0.549,10.595,1.752,0.023
3,800501,0.775,0.000,2.368,0.044,0.000,1.594,0.177,0.000
4,800810,0.544,0.000,1.234,0.000,0.000,3.738,0.581,0.036

In [42]:
df_rain_lst_df_cd = pd.merge(df_rain_lst_df, df_cd, how = 'inner', on ='addrcode')
df_rain_lst_df_cd.head()

,Week,Year,addrcode,rainfall,temperature,DF10000Pop,bin,bowl,bucket,misc_short,jar,pottedplant,tire,misc_tall
0,1,2015,800101,0.00,26.817500,0.000000,46.919,3.551,120.213,2.029,2.917,164.469,20.796,0.634
1,1,2016,800101,558.52,29.466250,0.686845,46.919,3.551,120.213,2.029,2.917,164.469,20.796,0.634
2,2,2015,800101,68.88,26.654821,0.457896,46.919,3.551,120.213,2.029,2.917,164.469,20.796,0.634
3,2,2016,800101,135.14,29.840000,0.686845,46.919,3.551,120.213,2.029,2.917,164.469,20.796,0.634
4,3,2015,800101,7.99,27.230000,0.000000,46.919,3.551,120.213,2.029,2.917,164.469,20.796,0.634

In [43]:
df_pop = pd.read_csv(os.path.join('Data','Population','full-info','Nakhon-population-details.csv'))
df_pop = df_pop.drop('district', axis = 1)
df_pop['addrcode'] = df_pop['addrcode'].astype(str)
df_pop.head()

,addrcode,Age < 7,Age 7 - 9,Age 10 - 14,Age 15 - 24,Age 25 - 34,Age 35 - 44,Age 45 - 60,Age > 60
0,801611,552,242,442,1058,1078,1057,1344,1118
1,800708,654,308,514,1265,1334,1451,2008,1424
2,801206,377,138,262,671,745,792,1061,1055
3,800301,595,248,446,922,1096,1240,1847,1150
4,800907,1142,491,720,1486,1713,1669,2092,1273

In [44]:
df_rain_lst_df_cd_pop = pd.merge(df_rain_lst_df_cd, df_pop, how = 'inner', on ='addrcode')
df_rain_lst_df_cd_pop.head()

,Week,Year,addrcode,rainfall,temperature,DF10000Pop,bin,bowl,bucket,misc_short,...,tire,misc_tall,Age < 7,Age 7 - 9,Age 10 - 14,Age 15 - 24,Age 25 - 34,Age 35 - 44,Age 45 - 60,Age > 60
0,1,2015,800101,0.00,26.817500,0.000000,46.919,3.551,120.213,2.029,...,20.796,0.634,3786,1934,3354,7153,5710,5753,8958,6584
1,1,2016,800101,558.52,29.466250,0.686845,46.919,3.551,120.213,2.029,...,20.796,0.634,3786,1934,3354,7153,5710,5753,8958,6584
2,2,2015,800101,68.88,26.654821,0.457896,46.919,3.551,120.213,2.029,...,20.796,0.634,3786,1934,3354,7153,5710,5753,8958,6584
3,2,2016,800101,135.14,29.840000,0.686845,46.919,3.551,120.213,2.029,...,20.796,0.634,3786,1934,3354,7153,5710,5753,8958,6584
4,3,2015,800101,7.99,27.230000,0.000000,46.919,3.551,120.213,2.029,...,20.796,0.634,3786,1934,3354,7153,5710,5753,8958,6584

In [45]:
df_rain_lst_df_cd_pop = df_rain_lst_df_cd_pop.sort_values(['addrcode','Year'])
df_rain_lst_df_cd_pop.head()

,Week,Year,addrcode,rainfall,temperature,DF10000Pop,bin,bowl,bucket,misc_short,...,tire,misc_tall,Age < 7,Age 7 - 9,Age 10 - 14,Age 15 - 24,Age 25 - 34,Age 35 - 44,Age 45 - 60,Age > 60
16,9,2014,800101,0.00,32.860714,0.0,46.919,3.551,120.213,2.029,...,20.796,0.634,3786,1934,3354,7153,5710,5753,8958,6584
19,10,2014,800101,0.00,33.384643,0.0,46.919,3.551,120.213,2.029,...,20.796,0.634,3786,1934,3354,7153,5710,5753,8958,6584
22,11,2014,800101,0.00,34.051964,0.0,46.919,3.551,120.213,2.029,...,20.796,0.634,3786,1934,3354,7153,5710,5753,8958,6584
25,12,2014,800101,1.75,34.622857,0.0,46.919,3.551,120.213,2.029,...,20.796,0.634,3786,1934,3354,7153,5710,5753,8958,6584
28,13,2014,800101,0.08,34.353750,0.0,46.919,3.551,120.213,2.029,...,20.796,0.634,3786,1934,3354,7153,5710,5753,8958,6584

In [46]:
df_rain_lst_df_cd_pop.to_csv('train.csv', encoding ='utf-8')

### 2017 [Testing]

In [65]:
df_rain = pd.read_csv(os.path.join('Data','Climatic Data','Rainfall_Nakhon_Krabi.csv'))
df_rain = df_rain.drop('Unnamed: 0', axis =1 )
df_rain['addrcode'] = df_rain['addrcode'].astype(str)
df_rain = df_rain.loc[df_rain['addrcode'].str[:2] == '80']
df_lst_2017 = pd.read_csv(os.path.join('Data','Climatic Data','LST_weekly_NST_2017.csv'))
df_lst_2017 = df_lst_2017.drop('Unnamed: 0', axis =1 )
df_lst_2017['addrcode'] = df_lst_2017['addrcode'].astype(str)
df_lst_2017['Year'] = df_lst_2017['Year'].astype(str)
df_df10000pop = pd.read_csv(os.path.join('Data','Dengue-cases','Dengue fever data','DFp10000Population_NST.csv'))

In [66]:
df_rain = df_rain.loc[df_rain['Year'] == 2017]
df_rain = df_rain.sort_values(['Week','Year','addrcode'])
df_rain = df_rain[['Week','Year','addrcode','rainfall']]
df_rain['Year'] = df_rain['Year'].astype(str)
len(df_rain)

8684

In [67]:
df_rain_lst = pd.merge(df_rain,df_lst_2017, how = 'inner', on = ['Week','Year','addrcode'])
df_rain_lst.head()

   Week  Year addrcode  rainfall  temperature
0     1  2017   800101     19.26       26.320
1     1  2017   800102     19.26       24.645
2     1  2017   800103     19.26       24.645
3     1  2017   800106     22.51       24.745
4     1  2017   800107     22.51       23.945

In [68]:
df_df = pd.read_csv(os.path.join('Data','Dengue-cases','Dengue fever data','DF_10000Population.csv'))
df_df = df_df.drop(['Unnamed: 0','NumberCases','population'], axis = 1)
df_df.columns = ['addrcode','Year','Week','DF10000Pop']
df_df['addrcode'] = df_df['addrcode'].astype(str)
df_df['Year'] = df_df['Year'].astype(str)
df_df.head()

  addrcode  Year  Week  DF10000Pop
0   100101  2014     1         0.0
1   100101  2014     2         0.0
2   100101  2014     3         0.0
3   100101  2014     4         0.0
4   100101  2014     5         0.0

In [69]:
df_rain_lst_df = pd.merge(df_rain_lst, df_df, how = 'inner', on = ['Year','Week','addrcode'])
df_rain_lst_df.head()

   Week  Year addrcode  rainfall  temperature  DF10000Pop
0     1  2017   800101     19.26       26.320    0.228948
1     1  2017   800102     19.26       24.645    0.575374
2     1  2017   800103     19.26       24.645    0.000000
3     1  2017   800106     22.51       24.745    0.000000
4     1  2017   800107     22.51       23.945    1.343725

In [70]:
df_cd = pd.read_csv(os.path.join('Data','Container Density','Subdistrict Level','CD_NST_subdist.csv'))
df_cd = df_cd.drop(['Unnamed: 0','total'],axis = 1)
df_cd['addrcode'] = df_cd['addrcode'].astype(str)
df_cd.head()

,addrcode,bin,bowl,bucket,misc_short,jar,pottedplant,tire,misc_tall
0,800204,1.373,0.009,2.933,0.019,0.000,1.653,0.346,0.000
1,800807,1.113,0.059,5.389,0.029,0.029,4.305,0.937,0.029
2,800120,1.495,0.187,9.193,0.234,0.549,10.595,1.752,0.023
3,800501,0.775,0.000,2.368,0.044,0.000,1.594,0.177,0.000
4,800810,0.544,0.000,1.234,0.000,0.000,3.738,0.581,0.036

In [71]:
df_rain_lst_df_cd = pd.merge(df_rain_lst_df, df_cd, how = 'inner', on ='addrcode')
df_rain_lst_df_cd.head()

,Week,Year,addrcode,rainfall,temperature,DF10000Pop,bin,bowl,bucket,misc_short,jar,pottedplant,tire,misc_tall
0,1,2017,800101,19.26,26.320000,0.228948,46.919,3.551,120.213,2.029,2.917,164.469,20.796,0.634
1,2,2017,800101,85.21,25.900000,0.457896,46.919,3.551,120.213,2.029,2.917,164.469,20.796,0.634
2,3,2017,800101,74.16,26.101786,1.144741,46.919,3.551,120.213,2.029,2.917,164.469,20.796,0.634
3,4,2017,800101,68.64,27.526429,1.373689,46.919,3.551,120.213,2.029,2.917,164.469,20.796,0.634
4,5,2017,800101,19.79,28.921429,1.144741,46.919,3.551,120.213,2.029,2.917,164.469,20.796,0.634

In [72]:
df_pop = pd.read_csv(os.path.join('Data','Population','full-info','Nakhon-population-details.csv'))
df_pop = df_pop.drop('district', axis = 1)
df_pop['addrcode'] = df_pop['addrcode'].astype(str)
df_pop.head()

,addrcode,Age < 7,Age 7 - 9,Age 10 - 14,Age 15 - 24,Age 25 - 34,Age 35 - 44,Age 45 - 60,Age > 60
0,801611,552,242,442,1058,1078,1057,1344,1118
1,800708,654,308,514,1265,1334,1451,2008,1424
2,801206,377,138,262,671,745,792,1061,1055
3,800301,595,248,446,922,1096,1240,1847,1150
4,800907,1142,491,720,1486,1713,1669,2092,1273

In [73]:
df_rain_lst_df_cd_pop = pd.merge(df_rain_lst_df_cd, df_pop, how = 'inner', on ='addrcode')
df_rain_lst_df_cd_pop.head()

,Week,Year,addrcode,rainfall,temperature,DF10000Pop,bin,bowl,bucket,misc_short,...,tire,misc_tall,Age < 7,Age 7 - 9,Age 10 - 14,Age 15 - 24,Age 25 - 34,Age 35 - 44,Age 45 - 60,Age > 60
0,1,2017,800101,19.26,26.320000,0.228948,46.919,3.551,120.213,2.029,...,20.796,0.634,3786,1934,3354,7153,5710,5753,8958,6584
1,2,2017,800101,85.21,25.900000,0.457896,46.919,3.551,120.213,2.029,...,20.796,0.634,3786,1934,3354,7153,5710,5753,8958,6584
2,3,2017,800101,74.16,26.101786,1.144741,46.919,3.551,120.213,2.029,...,20.796,0.634,3786,1934,3354,7153,5710,5753,8958,6584
3,4,2017,800101,68.64,27.526429,1.373689,46.919,3.551,120.213,2.029,...,20.796,0.634,3786,1934,3354,7153,5710,5753,8958,6584
4,5,2017,800101,19.79,28.921429,1.144741,46.919,3.551,120.213,2.029,...,20.796,0.634,3786,1934,3354,7153,5710,5753,8958,6584

In [74]:
df_rain_lst_df_cd_pop = df_rain_lst_df_cd_pop.sort_values(['addrcode','Year'])
df_rain_lst_df_cd_pop.head()

,Week,Year,addrcode,rainfall,temperature,DF10000Pop,bin,bowl,bucket,misc_short,...,tire,misc_tall,Age < 7,Age 7 - 9,Age 10 - 14,Age 15 - 24,Age 25 - 34,Age 35 - 44,Age 45 - 60,Age > 60
0,1,2017,800101,19.26,26.320000,0.228948,46.919,3.551,120.213,2.029,...,20.796,0.634,3786,1934,3354,7153,5710,5753,8958,6584
1,2,2017,800101,85.21,25.900000,0.457896,46.919,3.551,120.213,2.029,...,20.796,0.634,3786,1934,3354,7153,5710,5753,8958,6584
2,3,2017,800101,74.16,26.101786,1.144741,46.919,3.551,120.213,2.029,...,20.796,0.634,3786,1934,3354,7153,5710,5753,8958,6584
3,4,2017,800101,68.64,27.526429,1.373689,46.919,3.551,120.213,2.029,...,20.796,0.634,3786,1934,3354,7153,5710,5753,8958,6584
4,5,2017,800101,19.79,28.921429,1.144741,46.919,3.551,120.213,2.029,...,20.796,0.634,3786,1934,3354,7153,5710,5753,8958,6584

In [75]:
df_rain_lst_df_cd_pop.to_csv('test.csv', encoding ='utf-8')